In [4]:
import pandas as pd 
import numpy as np
data=pd.DataFrame([[1,2,3],['tom','cat','jerry'],[2,3,4]],columns=['a','c','d'],index=[[1,1,2],['a','e','r']])
data

       a    c      d
1 a    1    2      3
  e  tom  cat  jerry
2 r    2    3      4

# 好像不能按照行号和列号删除

In [5]:
data.drop([2],axis=0,inplace=True)
data

       a    c      d
1 a    1    2      3
  e  tom  cat  jerry

# 按照某一列的唯一项目来分组

In [12]:
df = pd.DataFrame({
'sex':['man','man','women','women','man','women','man',
      'women','women'],
'age':[15,23,25,17,35,57,24,31,22],
'smoke':[True,False,False,True,True,False,False,True,False],
'height':[168,179,181,166,173,178,188,190,160]
})
print (df)
df=df.pivot_table(index='sex')
df

     sex  age  smoke  height
0    man   15   True     168
1    man   23  False     179
2  women   25  False     181
3  women   17   True     166
4    man   35   True     173
5  women   57  False     178
6    man   24  False     188
7  women   31   True     190
8  women   22  False     160

         age  height  smoke
sex
man    24.25   177.0    0.5
women  30.40   175.0    0.4